[
  "Whether you think you can or you can't, you're right.",
  "Even if you think you can, you probably can't — not in production.",
  "Work smarter, not harder.",
  "Work harder, not smarter. Smarter people already automated your job.",
  "There’s no place like 127.0.0.1.",
  "To err is human. To really mess things up, use recursion.",
  "Keep it simple, stupid.",
  "Make it as complicated as possible — it’s job security.",
  "Move fast and break things.",
  "Move slow and fix what fast people broke.",
  "If it works, don’t touch it.",
  "If it works, it’s probably a coincidence.",
  "Code like nobody’s watching. Commit like everybody is.",
  "Git happens.",
  "A bug is just an undocumented feature.",
  "Premature optimization is the root of all evil.",
  "Rewriting from scratch will definitely fix everything. Probably.",
  "You are not paid to write code. You are paid to understand why it’s broken.",
  "There are two hard things in computer science: cache invalidation, naming things, and off-by-one errors.",
  "Never test in production. Unless you already are.",
  "JSON is like duct tape — it fixes everything until it doesn’t.",
  "Always validate your JSON before bragging about it.",
  "In the world of APIs, JSON is both the problem and the solution.",
  "True love is when your JSON parses on the first try.",
  "There’s no such thing as too much indentation... until there is.",
  "Remember: ‘undefined’ is not a valid JSON value.",
  "Weeks of coding can save you hours of planning.",
  "Good code is like a good joke — it needs no explanation.",
  "If debugging is the process of removing bugs, then programming must be the process of putting them in.",
  "There’s always one more bug.",
  "Code never lies, comments sometimes do.",
  "Premature optimization is the root of all evil.",
  "It works on my machine.",
  "Deleted code is debugged code.",
  "The best code is no code at all.",
  "Programming is 10% writing code and 90% understanding why it doesn’t work.",
  "A user interface is like a joke. If you have to explain it, it’s not that good.",
  "Simplicity is the soul of efficiency.",
  "Talk is cheap. Show me the code.",
  "There are two hard things in computer science: cache invalidation, naming things, and off-by-one errors.",
  "The cleaner the code, the fewer the excuses.",
  "Version 1.0 is just the start of the bug list.",
  "To iterate is human; to recurse, divine.",
  "If you don’t test it, it doesn’t work.",
  "There’s no place like 127.0.0.1.",
  "Sometimes the best algorithm is a good night’s sleep.",
  "Refactoring is like cleaning your room — nobody wants to, but everyone likes the result.",
  "You can’t patch human stupidity.",
  "First, solve the problem. Then, write the code.",
  "Every ‘temporary fix’ is permanent.",
  "If it compiles, ship it.",
  "The best part of programming is deleting code.",
  "Always code as if the guy who ends up maintaining your code is a violent psychopath who knows where you live.",
  "You don’t learn programming by watching tutorials; you learn it by breaking things.",
  "Real programmers count from zero.",
  "A good programmer is someone who looks both ways before crossing a one-way street.",
  "If brute force doesn’t solve your problem, you’re not using enough of it.",
  "In theory, theory and practice are the same. In practice, they’re not.",
  "It’s not a bug — it’s an undocumented feature.",
  "If you don’t automate it, you’ll repeat it forever.",
  "A bad system will beat a good person every time.",
  "Don’t comment bad code — rewrite it.",
  "The sooner you start to code, the longer the program will take.",
  "The perfect is the enemy of the good.",
  "Programming without coffee is just typing.",
  "Documentation is like sex: when it’s good, it’s really good; when it’s bad, it’s better than nothing.",
  "Every great developer you know got there by solving problems they were unqualified to solve until they did it.",
  "Code is like humor — when you have to explain it, it’s bad.",
  "Work smart, not hard — unless you’re debugging.",
  "Make it work, make it right, make it fast — in that order.",
  "There is no Ctrl+Z in production.",
  "A ship in harbor is safe, but that’s not what ships are built for — deploy it.",
  "Programming is the art of telling another human what one wants the computer to do.",
  "Computers do what you tell them to do, not what you want them to do.",
  "The more code you write, the more bugs you create.",
  "There’s nothing quite so permanent as a temporary hack.",
  "If you think your code is perfect, you haven’t looked at it long enough.",
  "The best time to write tests was yesterday.",
  "Debugging is like being the detective in a crime movie where you are also the murderer.",
  "The most expensive code is the one you didn’t delete.",
  "Without requirements or design, programming is the art of adding bugs to an empty text file.",
  "A bug is just an unexpected feature.",
  "Every program attempts to expand until it can read email.",
  "There’s no cloud — just someone else’s computer.",
  "Move fast and break things — then write tests.",
  "Software and cathedrals are much the same — first we build them, then we pray.",
  "You can’t manage what you don’t measure.",
  "Don’t fix bugs late at night; that’s when you add new ones.",
  "The computer was born to solve problems that did not exist before.",
  "If it works, don’t touch it.",
  "Tests don’t prove the absence of bugs, only their presence.",
  "The key to performance is knowing when it doesn’t matter.",
  "No one has ever said, ‘I wish this code was less readable.’",
  "The best engineers are lazy — in a productive way.",
  "You miss 100% of the commits you don’t push.",
  "Meetings: because none of us is as dumb as all of us.",
  "Your code is only as good as your naming conventions.",
  "Don’t repeat yourself — unless it’s a joke.",
  "Shipping is a feature — your product needs it.",
  "Real developers ship.",
  "An API is a promise; break it, and you break trust.",
  "Don’t deploy on Friday.",
  "In God we trust; all others must bring data.",
  "The best optimization is deletion.",
  "Bugs are just misunderstood features.",
  "A deadline is a bug in your calendar.",
  "If you torture data long enough, it will confess.",
  "Everything is easy if someone else did it first.",
  "Don’t be clever — be clear.",
  "Always leave the campground cleaner than you found it — applies to code too.",
  "The best tool is the one you actually use.",
  "If you don’t understand it, you can’t optimize it.",
  "Good engineers automate themselves out of a job.",
  "Beware of code that’s proud of being ‘smart’.",
  "You can’t fix what you don’t understand.",
  "Code for humans first, machines second.",
  "The longer the comment, the worse the code.",
  "When in doubt, log it.",
  "Don’t trust user input. Ever.",
  "Keep it simple, make it solid, then make it fast.",
  "A junior dev fixes the bug. A senior dev fixes the process.",
  "You can’t copy-paste experience.",
  "Legacy code is code that works.",
  "The best debugger is still print().",
  "If you’re not embarrassed by your first release, you shipped too late.",
  "Every commit tells a story. Make yours readable.",
  "Read code like a lawyer, write code like a poet."
]